In [3]:
import pandas as pd

In [1]:
d = [
    {'naam':'Peter', 'gebdatum':'1956-08-20'},
    {'naam':'Glenn', 'gebdatum':'1992-04-19'},
    {'naam':'Mariska', 'gebdatum':'1973-10-26'},
]

In [2]:
d

[{'naam': 'Peter', 'gebdatum': '1956-08-20'},
 {'naam': 'Glenn', 'gebdatum': '1992-04-19'},
 {'naam': 'Mariska', 'gebdatum': '1973-10-26'}]

In [4]:
df = pd.DataFrame(d)

In [5]:
df

      naam    gebdatum
0    Peter  1956-08-20
1    Glenn  1992-04-19
2  Mariska  1973-10-26

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   naam      3 non-null      object
 1   gebdatum  3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [8]:
df['dob'] = pd.to_datetime(df['gebdatum'])

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   naam      3 non-null      object
 1   gebdatum  3 non-null      object
 2   dob       3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [14]:
df['age'] = pd.Timestamp.now() - df['dob']

In [15]:
df

      naam    gebdatum        dob                        age
0    Peter  1956-08-20 1956-08-20 23992 days 14:22:29.963453
1    Glenn  1992-04-19 1992-04-19 10966 days 14:22:29.963453
2  Mariska  1973-10-26 1973-10-26 17716 days 14:22:29.963453

In [21]:
(df['age'] / pd.Timedelta('365 days')).astype('int')

0    65
1    30
2    48
Name: age, dtype: int64